#!/usr/bin/env python3

import random

objs = subjs = [
    "я",
    "ты",
    "он",
    "она",
    "мы",
    "вы",
    "они",
    "слон",
    "шкаф",
    "колобок",
    "пельмень",
    "стол",
    "стул",
    "корова"
]

actions = [
    "идти",
    "рисовать",
    "брать",
    "класть",
    "убежать",
    "рассказывать",
    "говорить",
    "петь",
    "смотреть",
    "видеть",
    "слушать",
    "слышать",
    "качаться",
    "бояться",
    "прыгать"
]


adv_mods = [
    "редко",
    "часто",
    "ночью",
    "днем",
    "за границей",
    "громко",
    "тихо",
    "быстро",
    "медленно",
    "сильно",
    "слабо",
    "плохо",
    "хорошо",
    "послушно",
    "весело",
    "грустно",
    "интересно",
    "волшебно"
]


order = [objs, actions, subjs, adv_mods]


for i in range(10):
    example = []
    for w in order:
        n = len(w)
        idx = random.randint(0, n - 1)
        example.append(w[idx])
    print(" ".join(example))








